# This file is generated by Anlogic Timing Wizard. 29 09 2020

#Created Clock
create_clock -name clk0_out -period 13.33 -waveform {0 6.67} [get_nets {clk0_out}]
create_clock -name i_spi_clk -period 56 -waveform {0 23} [get_nets {i_spi_clk}]
create_clock -name osc_clk -period 3.759 -waveform {0 1.879} [get_pins {eg_phy_osc_266mhz.osc_clk}]

#Set Clock Uncertainty
set_clock_uncertainty 0.325  [get_clocks {clk0_out}]
set_clock_uncertainty 1.15  [get_clocks {i_spi_clk}]

#Set False Path
set_false_path  -from [get_clocks {clk0_out}] -to [get_clocks {i_spi_clk}]
set_false_path  -from [get_clocks {i_spi_clk}] -to [get_clocks {clk0_out}]
set_false_path  -from [get_clocks {clk0_out}] -to [get_nets {i_system_reset}]

#
set_input_delay -clock i_spi_clk -min 74 [get_ports {i_spi_ss_n}]
set_input_delay -clock i_spi_clk -min 5 [get_ports {i_spi_mosi}]
#set_input_delay -clock i_spi_clk 74 [get_ports {i_spi_ss_n}]
set_output_delay -clock i_spi_clk -min 3 [get_ports {o_spi_miso}]
set_output_delay -clock i_spi_clk -max 10 [get_ports {o_spi_miso}]
